function printMartyra(initial, person, data, date, timeFormatter) {
  return `ΕΚΘΕΣΗ ΕΝΟΡΚΗΣ ΕΞΕΤΑΣΗΣ ΜΑΡΤΥΡΑ (Κ.Π.Δ.)
  ${initial.replace(
    /(\r\n|\n|\r|\s{2,})/gm,
    " "
  )} της ίδιας Υπηρεσίας, προσληφθέντος ως Β’ Ανακριτικού Υπαλλήλου, εμφανίσθηκε ο κατωτέρω σημειούμενος μάρτυρας, ο οποίος αφού ρωτήθηκε για την ταυτότητά του κ.λ.π. απάντησε ότι ονομάζεται ${person}. Έπειτα ο εξεταζόμενος, ορκίσθηκε σύμφωνα με το άρθρο 219 παρ. 1 του Κ.Π. Δικονομίας, και στην συνέχεια εξετάζεται ως ακολούθως:
  ΕΡΩΤΗΣΗ: Τι προσήλθατε να καταθέσετε στο ${data.ypiresia}; 
  ΑΠΟΚΡΙΣΗ: **************************. Επιθυμώ την ποινική δίωξη του - ων άγνωστου - ων δράστη - ων. Τίποτα δεν έχω να προσθέσω και υπογράφω. 
  Στον εξεταζόμενο γνωστοποιήσαμε ότι μπορεί να λαμβάνει εγκαίρως γνώση των εγγράφων της δίκης, τα οποία του επιδίδονται και με ηλεκτρονικά μέσα, σύμφωνα με τις παρ. 1 και 4 του άρθρου 155 Κ.Π.Δ.
  Η παρούσα έκθεση άρχισε να συντάσσεται την ${timeFormatter(
    date,
    0
  )}' ώρα της σήμερον και περατώθηκε την ${timeFormatter(
    date,
    data.xronosPeratosis
  )}' ώρα της ιδίας.
  Για πιστοποίηση συντάχθηκε η παρούσα έκθεση, η οποία αφού αναγνώστηκε και βεβαιώθηκε υπογράφεται ως ακολούθως:`;
}
function printSyllipsi(
  initial,
  person,
  data,
  date,
  timeFormatter,
  dateFormatter
) {
  return `Ε Κ Θ Ε Σ Η    Σ Υ Λ Λ Η Ψ Η Σ 
    ${initial.replace(
      /(\r\n|\n|\r|\s{2,})/gm,
      " "
    )} της ίδιας Υπηρεσίας που προσλήφθηκε ως β΄ ανακριτικός υπάλληλος, οδηγήθηκε στο κατάστημα του ${
    data.ypiresia
  } από τον (Αστυνομικός) του (Υπηρεσια που υπηρετεί) ο οποίος τους συνέλαβε την ${dateFormatter(
    date
  )} και ώρα ${timeFormatter(
    date,
    -10
  )} στην ενταύθα οδό Λ Δημοκρατίας αρ. 3, ${person}, για παράβαση του (άρθρου *****). 
  Αφού εξέτασα αυτούς και πείσθηκα ότι ουδεμία ως προς την ταυτότητά τους υπάρχει αμφιβολία διέταξα την στον κ. Εισαγγελέα Πρωτοδικών Ροδόπης παραπομπή και παράδοση αυτών με την παρούσα έκθεση.
  Η παρούσα έκθεση άρχισε να συντάσσεται την ${timeFormatter(
    date,
    0
  )}΄ ώρα και περατώθηκε την ${timeFormatter(date, data.xronosPeratosis)}΄ ώρα.
  Για πιστοποίηση συντάχθηκε η παρούσα έκθεση, η οποία αφού αναγνώσθηκε και βεβαιώθηκε υπογράφεται ως ακολούθως:`;
}

export { printMartyra, printSyllipsi };
