function printMartyra(initial, person, data, date, timeFormatter) {
  return `<p> ${initial.replace(
    /(\r\n|\n|\r|\s{2,})/gm,
    " "
  )}της ίδιας Υπηρεσίας, προσληφθέντος ως Β’ Ανακριτικού Υπαλλήλου, εμφανίσθηκε ο κατωτέρω σημειούμενος μάρτυρας, ο οποίος αφού ρωτήθηκε για την ταυτότητά του κ.λ.π. απάντησε ότι ονομάζεται ${person}. Έπειτα ο εξεταζόμενος, ορκίσθηκε σύμφωνα με το άρθρο 219 παρ. 1 του Κ.Π. Δικονομίας, και στην συνέχεια εξετάζεται ως ακολούθως:<br><u>ΕΡΩΤΗΣΗ:</u> Τι προσήλθατε να καταθέσετε στο ${
    data.ypiresia
  };<br><u>ΑΠΟΚΡΙΣΗ:</u> **************************. Επιθυμώ την ποινική δίωξη του - ων άγνωστου - ων δράστη - ων. Τίποτα δεν έχω να προσθέσω και υπογράφω.<br> Στον εξεταζόμενο γνωστοποιήσαμε ότι μπορεί να λαμβάνει εγκαίρως γνώση των εγγράφων της δίκης, τα οποία του επιδίδονται και με ηλεκτρονικά μέσα, σύμφωνα με τις παρ. 1 και 4 του άρθρου 155 Κ.Π.Δ.</p>
<p>Η παρούσα έκθεση άρχισε να συντάσσεται την ${timeFormatter(
    date
  )} ώρα της σήμερον και περατώθηκε την ${timeFormatter(
    date,
    data.xronosPeratosis
  )} ώρα της ιδίας.</p>
<p>Για πιστοποίηση συντάχθηκε η παρούσα έκθεση, η οποία αφού αναγνώστηκε και βεβαιώθηκε υπογράφεται ως ακολούθως:</p>
`;
}
function printSyllipsi(
  initial,
  person,
  data,
  date,
  timeFormatter,
  dateFormatter
) {
  return `<p> ${initial.replace(
    /(\r\n|\n|\r|\s{2,})/gm,
    " "
  )}της ίδιας Υπηρεσίας που προσλήφθηκε ως β΄ ανακριτικός υπάλληλος, οδηγήθηκε στο κατάστημα του ${
    data.ypiresia
  } από τον (Αστυνομικός) του (Υπηρεσια που υπηρετεί) ο οποίος τον συνέλαβε την ${dateFormatter(
    date
  )} και ώρα ${timeFormatter(date, -10)} στην ενταύθα οδό ${
    data.dieuthynsiYpiresias
  }, ${person}, για παράβαση του (άρθρου *****).<br> Αφού εξέτασα αυτόν και πείσθηκα ότι ουδεμία ως προς την ταυτότητά του υπάρχει αμφιβολία διέταξα την στον κ. Εισαγγελέα Πρωτοδικών ${
    data.eisaggeleiaProtodikon
  } παραπομπή και παράδοση αυτού με την παρούσα έκθεση.</p>
<p>Η παρούσα έκθεση άρχισε να συντάσσεται την ${timeFormatter(
    date
  )}΄ ώρα και περατώθηκε την ${timeFormatter(
    date,
    data.xronosPeratosis
  )}΄ ώρα.</p>
<p>Για πιστοποίηση συντάχθηκε η παρούσα έκθεση, η οποία αφού αναγνώσθηκε και βεβαιώθηκε υπογράφεται ως ακολούθως:</p>
`;
}
function printAnomoti(initial, person, data, date, timeFormatter) {
  return `<p>${initial.replace(
    /(\r\n|\n|\r|\s{2,})/gm,
    " "
  )}της ιδίας Υπηρεσίας προσληφθέντος ως Β΄ Ανακριτικού Υπαλλήλου, εμφανίστηκε ο κατωτέρω σημειούμενος εγκαλούμενος, ο οποίος, αφού ρωτήθηκε για την ταυτότητα του κ.λ.π., απάντησε ότι ονομάζεται ${person}.<br> Εξετάζεται χωρίς όρκο, σύμφωνα με τo άρθρο 244 παρ. 1 Κ.Π.Δ., γιατί ενεργείται προκαταρκτική εξέταση κατόπιν της υπ’ αριθ. ***** από **-**-**** Παραγγελία της Εισαγγελίας Πρωτοδικών ${
    data.eisaggeleiaProtodikon
  }.<br> Ενταύθα γνωρίσαμε σε αυτόν την πράξη που αφορά η εξέταση, ήτοι: για παράβαση του *****.<br> Στη συνέχεια, εξηγήσαμε στον εξεταζόμενο, με σαφήνεια όλα τα δικαιώματα του, που προβλέπονται από τα άρθρα 89, 90, 91, 92, 95, 96, 99, 100, 101, 102, 103 και 104 Κ.Π.Δ, καθώς και το δικαίωμα να διορίσει τεχνικό σύμβουλο σε περίπτωση διεξαγωγής πραγματογνωμοσύνης, εφαρμοζόμενης αναλόγως της διάταξης του άρθρου 183 και ειδικότερα, το δικαίωμα παράστασης με συνήγορο, το δικαίωμα και τις προϋποθέσεις παροχής δωρεάν νομικών συμβουλών, το δικαίωμα ενημέρωσης σχετικά με την κατηγορία, το δικαίωμα διερμηνείας και μετάφρασης, το δικαίωμα σιωπής και μη αυτοενοχοποίησης, το δικαίωμα πρόσβασης στο υλικό της δικογραφίας, το δικαίωμα ενημέρωσης των προξενικών αρχών και ενός επιπλέον προσώπου της επιλογής του, το δικαίωμα σε επείγουσα ιατρική περίθαλψη, τον ανώτατο αριθμό ωρών ή ημερών κατά τις οποίες ο κατηγορούμενος δύναται να στερηθεί της ελευθερίας της προτού προσαχθεί ενώπιον δικαστικής αρχής, το δικαίωμα άρνησης εν όλω ή εν μέρει της παροχής εξηγήσεων, το δικαίωμα προθεσμίας μέχρι σαράντα οκτώ ωρών για την παροχή τους, η οποία μπορεί να παραταθεί από εκείνον που διενεργεί την προκαταρκτική εξέταση, το δικαίωμα πρότασης μαρτύρων προς εξέταση και πληροφορίες σχετικά με τις δυνατότητες προσβολής του νόμιμου χαρακτήρα της σύλληψης ή της κράτησης.</p>
<p><u>ΕΡΩΤΗΣΗ:</u> Επιθυμείτε να κάνετε χρήση των δικαιωμάτων που σας γνωστοποιήθηκαν?</p>
<p><u>ΑΠΟΚΡΊΣΗ:</u> Όχι δεν επιθυμώ και θέλω να εξεταστώ αμέσως.</p>
<p>Ύστερα από τα ανωτέρω προβήκαμε στην παροχή εξηγήσεων.</p>
<p><u>ΕΡΩΤΗΣΗ:</u> Έχετε κατηγορηθεί στο παρελθόν και για ποια αιτία?</p>
<p><u>ΑΠΟΚΡΙΣΗ:</u> Όχι , ποτέ.</p>
<p><u>ΕΡΩΤΗΣΗ:</u> Σας αποδίδονται ήδη οι πράξεις που σας γνωστοποιήθηκαν ανωτέρω. Ποιες είναι οι εξηγήσεις σας?</p>
<p><u>ΑΠΟΚΡΙΣΗ:</u> ************* . Τίποτε άλλο δεν έχω να προσθέσω και υπογράφω.</p>
<p>Η παρούσα έκθεση άρχισε να συντάσσεται την ${timeFormatter(
    date
  )}΄ ώρα της σήμερον και περατώθηκε την ${timeFormatter(
    date,
    data.xronosPeratosis
  )}΄ ώρα της ιδίας.</p>
<p>Για πιστοποίηση συντάχθηκε η παρούσα έκθεση, η οποία αφού αναγνώσθηκε και βεβαιώθηκε υπογράφεται ακολούθως:</p>
`;
}
function printKatigoroumenou(initial, person, data, date, timeFormatter) {
  return `<p>${initial.replace(
    /(\r\n|\n|\r|\s{2,})/gm,
    " "
  )}της ιδίας Υπηρεσίας, προσληφθέντος ως Β΄ Ανακριτικός Υπάλληλος, εξετάζεται ο κατωτέρω σημειούμενος κατηγορούμενος, ως ακολούθως:<br><u>ΕΡΩΤΗΣΗ:</u> Πως ονομάζεσαι κ.λ.π. ;<br><u>ΑΠΟΚΡΙΣΗ:</u> ${person}, ---άνευ--- τέκνων.<br>Ακολούθως γνωρίσαμε με σαφήνεια στον εξεταζόμενο ολόκληρο το περιεχόμενο της κατηγορίας και ότι κατηγορείται για παράβαση του **** , και συγκεκριμένα: ***** .<br>Στην συνέχεια, αφού ανακοινώσαμε στον εξεταζόμενο το περιεχόμενο των εγγράφων της ανάκρισης, εξηγήσαμε σ’ αυτόν σύμφωνα με το άρθρο 105 του Κ.Π.Δ., με σαφήνεια όλα τα δικαιώματά του που προβλέπονται από τα άρθρα 91, 95, 96, 97, 98, 100, 101, 103 και 104, 273 και 274 του Κωδ. Ποιν. Δικονομίας και ειδικότερα: το δικαίωμα παράστασης με συνήγορο, το δικαίωμα και τις προϋποθέσεις παροχής δωρεάν νομικών συμβουλών, το δικαίωμα ενημέρωσης σχετικά με την κατηγορία, το δικαίωμα διερμηνείας και μετάφρασης, το δικαίωμα σιωπής και μη αυτοενοχοποίησης, το δικαίωμα πρόσβασης στο υλικό της δικογραφίας, το δικαίωμα ενημέρωσης των προξενικών αρχών και επιπλέον προσώπων της επιλογής του, το δικαίωμα σε επείγουσα ιατρική περίθαλψη, τον ανώτατο αριθμό ωρών ή ημερών κατά τις οποίες ο κατηγορούμενος δύναται να στερηθεί της ελευθερίας του προτού προσαχθεί ενώπιον δικαστικής αρχής, το δικαίωμα άρνησης εν όλω ή εν μέρει της απολογίας, το δικαίωμα προθεσμίας τουλάχιστον σαράντα οκτώ ωρών για να απολογηθεί, η οποία μπορεί να παραταθεί από εκείνον που διενεργεί την προανάκριση, το δικαίωμα πρότασης μαρτύρων προς εξέταση και πληροφορίες σχετικά με τις δυνατότητες προσβολής του νόμιμου χαρακτήρα της σύλληψης ή της κράτησης.</p>
<p><u>ΕΡΩΤΗΣΗ:</u> Επιθυμείτε να κάνετε χρήση των δικαιωμάτων που σας γνωστοποιήθηκαν;</p>
<p><u>ΑΠΟΚΡΙΣΗ:</u> Έλαβα γνώση όλων των ανωτέρω δικαιωμάτων μου και επιθυμώ να απολογηθώ αμέσως άνευ συνηγόρου.</p>
<p>Ύστερα από τα ανωτέρω προβήκαμε στη λήψη της απολογίας του.</p>
<p>Για πίστωση συντάχθηκε η παρούσα έκθεση, η οποία αφού αναγνώσθηκε και βεβαιώθηκε, υπογράφεται ως ακολούθως:</p>
<table width="100%">
            <tr>
              <td width="33%" style="text-align: center">-Ο-</td>
              <td width="33%" style="text-align: center">-Ο-</td>
              <td width="33%" style="text-align: center">-Ο-</td>
            </tr>
            <tr>
              <td width="33%" style="text-align: center">
                Εξετασθείς Κατηγορούμενος
              </td>
              <td width="33%" style="text-align: center">Β'Ανακριτικός</td>
              <td width="33%" style="text-align: center">Ά Ανακριτικός</td>
            </tr>
          </table><br><br><br>
<p>Στην συνέχεια προβήκαμε στην εξέταση του κατηγορουμένου ως ακολούθως:</p>
<p><u>ΕΡΩΤΗΣΗ:</u> Κατηγορήθηκες άλλη φορά και για ποια αιτία;</p>
<p><u>ΑΠΟΚΡΙΣΗ:</u> Όχι, ποτέ.</p>
<p><u>ΕΡΩΤΗΣΗ:</u> Κατηγορείσαι ήδη για τις ως άνω πράξεις που σου γνωστοποιήθηκαν. Τι απολογείσαι;</p>
<p><u>ΑΠΟΚΡΙΣΗ:</u> ******** . Τίποτε άλλο δεν έχω να προσθέσω και υπογράφω.</p>
<p>Στον κατηγορούμενο γνωστοποιήσαμε ότι, σύμφωνα με το άρθρο 273 § 1 του Κ.Π.Δ., υποχρεούται να δηλώσει κάθε μεταβολή της κατοικίας ή της διαμονής του, μαζί με ακριβή διεύθυνση, εγγράφως στον Εισαγγελέα του δικαστηρίου στο οποίο εκκρεμεί κατά τον χρόνο δήλωσης η δικογραφία.</p>
<p>Η παρούσα έκθεση άρχισε να συντάσσεται την ${timeFormatter(
    date
  )}΄ ώρα και περατώθηκε την ${timeFormatter(
    date,
    data.xronosPeratosis
  )}΄ ώρα. Για πίστωση συντάχθηκε η παρούσα έκθεση, η οποία αφού αναγνώσθηκε και βεβαιώθηκε, υπογράφεται ως ακολούθως:</p>
`;
}
function printApodosi(
  initial,
  person,
  data,
  date,
  timeFormatter,
  dateFormatter
) {
  return `<p>${initial.replace(
    /(\r\n|\n|\r|\s{2,})/gm,
    " "
  )}της ιδίας Υπηρεσίας, προσληφθέντα ως Β’ Ανακριτικό Υπάλληλο, εκθέτουμε τα ακόλουθα:<br>Επειδή από την προανάκριση που ενεργούμε για παράβαση του ****** , πειστήκαμε ότι ***** που αναφέρονται στην από ${dateFormatter(
    date
  )} Έκθεση Παράδοσης Παραλαβής και Κατάσχεσης ανήκουν στην κατοχή και κυριότητα του ${person}, τον οποίο προσκαλέσαμε και του τα αποδώσαμε.<br>Σ’ αυτόν υπομνήσαμε να διαφυλάξει τα ανωτέρω και να παραδώσει αυτά, σε κάθε αίτηση της δικαστικής αρχής.</p>
<p>Η παρούσα έκθεση άρχισε να συντάσσεται την ${timeFormatter(
    date
  )}΄ ώρα της σήμερον και περατώθηκε την ${timeFormatter(
    date,
    data.xronosPeratosis
  )}΄ ώρα της ιδίας.</p>
<p>Για πιστοποίηση συντάχθηκε η παρούσα έκθεση, η οποία αφού αναγνώσθηκε και βεβαιώθηκε, υπογράφεται ως ακολούθως:</p>
`;
}
function printKatasxesi(initial, person, data, date, timeFormatter) {
  return `<p>${initial.replace(
    /(\r\n|\n|\r|\s{2,})/gm,
    " "
  )}της ιδίας Υπηρεσίας, που προσλήφθηκε ως Β΄ Ανακριτικός Υπάλληλος, ενεργώντας προανάκριση για παράβαση του ****** σε βάρος του ${person}, εμφανίστηκε ενώπιον μας ο Αρχ/κας **** του ${
    data.ypiresia
  } και μας παρέδωσε ******.<br>Κατόπιν τούτου προβήκαμε στην κατάσχεση αυτών για να χρησιμοποιηθούν ως πειστήρια.</p>
<p>Γίνεται μνεία ότι η παρούσα έκθεση άρχισε να συντάσσεται την ${timeFormatter(
    date
  )}΄ ώρα της σήμερον και περατώθηκε την ${timeFormatter(
    date,
    data.xronosPeratosis
  )}΄ ώρα της ιδίας.</p>
<p>Προς πίστωση συντάχθηκε η παρούσα η οποία αναγνώσθηκε, βεβαιώθηκε και υπογράφεται ως ακολούθως:</p>
`;
}
function printGnostopoiisi(initial, person, data, date, timeFormatter) {
  return `<p>${initial.replace(
    /(\r\n|\n|\r|\s{2,})/gm,
    " "
  )}της ίδιας Υπηρεσίας, προσληφθέντος ως Β΄ Ανακριτικός Υπάλληλος, εκθέτουμε τα ακόλουθα:<br>Δυνάμει του άρθρου 95 του Κ.Π.Δ, γνωστοποιήσαμε στον παρακάτω κατηγορούμενο ${person}, τα ακόλουθα δικαιώματα της: α) το δικαίωμα παράστασης με συνήγορο, β) το δικαίωμα και τις προϋποθέσεις παροχής δωρεάν νομικών συμβούλων, γ) το δικαίωμα ενημέρωσης σχετικά με την κατηγορία, δ) το δικαίωμα διερμηνείας και μετάφρασης και ε) το δικαίωμα σιωπής και μη αυτοενοχοποίησης.</p>
<p>Η παρούσα έκθεση άρχισε να συντάσσεται την ${timeFormatter(
    date
  )}΄ ώρα της σήμερον και περατώθηκε την ${timeFormatter(
    date,
    data.xronosPeratosis
  )}΄ ώρα της ιδίας.</p>
<p>Για πιστοποίηση συντάχθηκε η παρούσα έκθεση, η οποία αφού αναγνώσθηκε και βεβαιώθηκε, υπογράφεται ως ακολούθως:</p>
`;
}
export {
  printMartyra,
  printSyllipsi,
  printAnomoti,
  printKatigoroumenou,
  printApodosi,
  printKatasxesi,
  printGnostopoiisi,
};
