const MALE_NAMES_MAP = {
  ΑΓΓΕΛΟΣ: "ΑΓΓΕΛΟΥ",
  ΑΘΑΝΑΣΙΟΣ: "ΑΘΑΝΑΣΙΟΥ",
  ΑΛΕΞΑΝΔΡΟΣ: "ΑΛΕΞΑΝΔΡΟΥ",
  ΑΝΤΩΝΙΟΣ: "ΑΝΤΩΝΙΟΥ",
  ΑΝΔΡΕΑΣ: "ΑΝΔΡΕΑ",
  ΑΡΙΣΤΕΙΔΗΣ: "ΑΡΙΣΤΕΙΔΗ",
  ΒΑΣΙΛΕΙΟΣ: "ΒΑΣΙΛΕΙΟΥ",
  ΓΕΩΡΓΙΟΣ: "ΓΕΩΡΓΙΟΥ",
  ΓΡΗΓΟΡΙΟΣ: "ΓΡΗΓΟΡΙΟΥ",
  ΔΗΜΗΤΡΙΟΣ: "ΔΗΜΗΤΡΙΟΥ",
  ΕΛΕΥΘΕΡΙΟΣ: "ΕΛΕΥΘΕΡΙΟΥ",
  ΕΥΑΓΓΕΛΟΣ: "ΕΥΑΓΓΕΛΟΥ",
  ΕΥΘΥΜΙΟΣ: "ΕΥΘΥΜΙΟΥ",
  ΗΛΙΑΣ: "ΗΛΙΑ",
  ΘΕΟΔΩΡΟΣ: "ΘΕΟΔΩΡΟΥ",
  ΙΩΑΝΝΗΣ: "ΙΩΑΝΝΗ",
  ΚΩΝΣΤΑΝΤΙΝΟΣ: "ΚΩΝΣΤΑΝΤΙΝΟΥ",
  ΛΑΖΑΡΟΣ: "ΛΑΖΑΡΟΥ",
  ΛΕΩΝΙΔΑΣ: "ΛΕΩΝΙΔΑ",
  ΜΑΡΚΟΣ: "ΜΑΡΚΟΥ",
  ΝΙΚΟΛΑΟΣ: "ΝΙΚΟΛΑΟΥ",
  ΠΑΝΑΓΙΩΤΗΣ: "ΠΑΝΑΓΙΩΤΗ",
  ΠΑΥΛΟΣ: "ΠΑΥΛΟΥ",
  ΠΕΤΡΟΣ: "ΠΕΤΡΟΥ",
  ΣΑΒΒΑΣ: "ΣΑΒΒΑ",
  ΣΠΥΡΙΔΩΝ: "ΣΠΥΡΙΔΩΝΑ",
  ΣΤΥΛΙΑΝΟΣ: "ΣΤΥΛΙΑΝΟΥ",
  ΣΤΑΥΡΟΣ: "ΣΤΑΥΡΟΥ",
  ΑΝΑΣΤΑΣΙΟΣ: "ΑΝΑΣΤΑΣΙΟΥ",
  ΧΑΡΑΛΑΜΠΟΣ: "ΧΑΡΑΛΑΜΠΟΥ",
  ΧΡΗΣΤΟΣ: "ΧΡΗΣΤΟΥ",
};

const FEMALE_NAMES_MAP = {
  ΑΓΓΕΛΙΚΗ: "ΑΓΓΕΛΙΚΗΣ",
  ΑΓΑΠΗ: "ΑΓΑΠΗΣ",
  ΑΝΑΣΤΑΣΙΑ: "ΑΝΑΣΤΑΣΙΑΣ",
  ΑΙΚΑΤΕΡΙΝΗ: "ΑΙΚΑΤΕΡΙΝΗΣ",
  ΑΝΝΑ: "ΑΝΝΑΣ",
  ΑΡΕΤΗ: "ΑΡΕΤΗΣ",
  ΑΡΙΑΔΝΗ: "ΑΡΙΑΔΝΗΣ",
  ΒΑΣΙΛΙΚΗ: "ΒΑΣΙΛΙΚΗΣ",
  ΔΑΝΑΗ: "ΔΑΝΑΗΣ",
  ΔΑΦΝΗ: "ΔΑΦΝΗΣ",
  ΔΕΣΠΟΙΝΑ: "ΔΕΣΠΟΙΝΑΣ",
  ΔΗΜΗΤΡΑ: "ΔΗΜΗΤΡΑΣ",
  ΕΙΡΗΝΗ: "ΕΙΡΗΝΗΣ",
  ΕΛΕΝΗ: "ΕΛΕΝΗΣ",
  ΕΛΕΟΝΩΡΑ: "ΕΛΕΟΝΩΡΑΣ",
  ΕΛΕΥΘΕΡΙΑ: "ΕΛΕΥΘΕΡΙΑΣ",
  ΕΥΑΓΓΕΛΙΑ: "ΕΥΑΓΓΕΛΙΑΣ",
  ΕΥΡΙΔΙΚΗ: "ΕΥΡΙΔΙΚΗΣ",
  ΓΕΩΡΓΙΑ: "ΓΕΩΡΓΙΑΣ",
  ΘΕΟΔΩΡΑ: "ΘΕΟΔΩΡΑΣ",
  ΙΩΑΝΝΑ: "ΙΩΑΝΝΑΣ",
  ΙΣΜΗΝΗ: "ΙΣΜΗΝΗΣ",
  ΚΩΣΤΑΝΤΙΝΑ: "ΚΩΝΣΤΑΝΤΙΝΑΣ",
  ΚΑΛΛΙΟΠΗ: "ΚΑΛΛΙΟΠΗΣ",
  ΜΑΡΓΑΡΙΤΑ: "ΜΑΡΓΑΡΙΤΑΣ",
  ΜΑΡΙΑ: "ΜΑΡΙΑΣ",
  ΝΙΚΟΛΕΤΑ: "ΝΙΚΟΛΕΤΑΣ",
  ΝΑΤΑΛΙΑ: "ΝΑΤΑΛΙΑΣ",
  ΠΑΡΑΣΚΕΥΗ: "ΠΑΡΑΣΚΕΥΗΣ",
  ΠΑΝΑΓΙΩΤΑ: "ΠΑΝΑΓΙΩΤΑΣ",
  ΣΟΦΙΑ: "ΣΟΦΙΑΣ",
  ΣΤΑΥΡΟΥΛΑ: "ΣΤΑΥΡΟΥΛΑΣ",
  ΣΤΑΜΑΤΙΑ: "ΣΤΑΜΑΤΙΑΣ",
  ΧΑΡΙΚΛΕΙΑ: "ΧΑΡΙΚΛΕΙΑΣ",
  ΧΑΡΟΥΛΑ: "ΧΑΡΟΥΛΑΣ",
  ΧΡΙΣΤΙΝΑ: "ΧΡΙΣΤΙΝΑΣ",
  ΧΡΥΣΑ: "ΧΡΥΣΑΣ",
  ΦΩΤΕΙΝΗ: "ΦΩΤΕΙΝΗΣ",
};

export function toGenitiveMale(name) {
  return MALE_NAMES_MAP[name] ?? name;
}

export function toGenitiveFemale(name) {
  return FEMALE_NAMES_MAP[name] ?? name;
}
const genderMap = {
  Γυναίκα: {
    o: "η",
    tou: "της",
    os: "η",
    ou: "ης",
    ton: "την",
    on: "ούσα",
  },
  Άνδρας: {
    o: "ο",
    tou: "του",
    os: "ος",
    ou: "ου",
    ton: "τον",
    on: "όντας",
  },
};
export function applyGrammar(state, gender, role = "A1") {
  const suffixMap = { suspect: "S", victim: "V", anakr1: "A1", anakr2: "A2" };
  const suffix = suffixMap[role] || "";

  // If no gender is provided, clear the variables
  if (!gender) {
    ["o", "tou", "os", "ou", "ton", "on"].forEach((key) => {
      state[`${key}${suffix}`] = "";
    });
    return;
  }

  const rules = genderMap[gender] || genderMap["Άνδρας"];
  Object.keys(rules).forEach((key) => {
    state[`${key}${suffix}`] = rules[key];
  });
}
